{
  "locationDetails": {
    "loc-downtown-001": {
      "locationId": "loc-downtown-001",
      "pointsOfInterest": [
        {
          "id": "poi-arasaka-tower",
          "name": "Arasaka Tower",
          "description": "Небоскреб Arasaka возвышается над всем Downtown. Корпоративный логотип светится в небе, символизируя власть и деньги. Вход охраняется корпоративной охраной. Обычным людям вход запрещен.",
          "type": "building",
          "actions": ["look", "approach"],
          "lookDescription": "Вы смотрите на Arasaka Tower. Высокий небоскреб, стеклянные фасады, неоновые вывески. Корпоративная охрана стоит на постах. Это символ власти и денег в Night City.",
          "approachDescription": "Вы подходите к Arasaka Tower. Охранник останавливает вас. \"Это частная территория. Вход запрещен.\" Вам нужно уйти или найти другой способ проникновения."
        },
        {
          "id": "poi-militech-building",
          "name": "Militech Building",
          "description": "Здание Militech - военной корпорации. Менее элегантное, чем Arasaka, но более функциональное. Здесь производят оружие и военное оборудование.",
          "type": "building",
          "actions": ["look", "approach"],
          "lookDescription": "Вы смотрите на Militech Building. Военная эстетика, функциональный дизайн, строгая охрана. Это место где производят оружие и военное оборудование.",
          "approachDescription": "Вы подходите к Militech Building. Охранник останавливает вас. \"Вход только для сотрудников и клиентов с пропусками.\" Вам нужно уйти."
        },
        {
          "id": "poi-ncpd-station",
          "name": "NCPD Station",
          "description": "Полицейский участок NCPD в Downtown. Здесь работают офицеры, которые поддерживают порядок в корпоративном районе. Можно получить задания или информацию.",
          "type": "building",
          "actions": ["look", "enter", "talk"],
          "lookDescription": "Вы смотрите на NCPD Station. Современное здание, полицейские машины у входа, офицеры патрулируют территорию. Это место где можно получить задания или информацию.",
          "enterDescription": "Вы входите в NCPD Station. Внутри чисто и организовано. Офицеры работают за компьютерами, некоторые разговаривают с гражданами. Вы можете подойти к дежурному офицеру."
        },
        {
          "id": "poi-trade-district",
          "name": "Торговый район",
          "description": "Торговый район Downtown. Здесь работают профессиональные торговцы, которые продают качественное оборудование. Цены выше, но качество гарантировано.",
          "type": "area",
          "actions": ["explore", "shop"],
          "exploreDescription": "Вы исследуете торговый район Downtown. Много магазинов, торговцев, покупателей. Все выглядит чисто и организовано. Здесь можно найти качественное оборудование.",
          "shopDescription": "Вы заходите в магазин. Торговец приветливо улыбается. \"Добро пожаловать! Что тебе нужно?\" У него есть хороший выбор товаров."
        }
      ],
      "ambientSounds": [
        "Гудение корпоративных машин",
        "Шум голосов прохожих",
        "Неоновые вывески мигают",
        "Корпоративная охрана патрулирует"
      ],
      "timeVariations": {
        "day": {
          "description": "Днем Downtown оживлен. Люди спешат на работу, корпоративные клиенты покупают товары, NCPD патрулирует улицы. Все выглядит безопасно и организовано."
        },
        "night": {
          "description": "Ночью Downtown пустеет. Большинство офисов закрыты, но неоновые вывески все еще мигают. Корпоративная охрана и NCPD патрулируют чаще, подозрительно глядя на прохожих."
        }
      }
    },
    "loc-watson-001": {
      "locationId": "loc-watson-001",
      "pointsOfInterest": [
        {
          "id": "poi-abandoned-factory",
          "name": "Заброшенный завод",
          "description": "Заброшенный завод в Watson. Руины прошлого, где когда-то производили технологии. Теперь банды используют его как убежище, торговцы - как склады.",
          "type": "building",
          "actions": ["look", "enter", "explore"],
          "lookDescription": "Вы смотрите на заброшенный завод. Руины, разрушенные стены, граффити банд. Это место где можно найти старые технологии и ресурсы, если быть осторожным.",
          "enterDescription": "Вы входите в заброшенный завод. Внутри темно и опасно. Вы слышите шаги и голоса. Кто-то здесь есть. Вы можете исследовать дальше, но это может быть опасно.",
          "exploreDescription": "Вы исследуете заброшенный завод. Вы находите старые технологии, компоненты, ресурсы. Но вы также видите бандитов, которые патрулируют территорию. Лучше быть осторожным."
        },
        {
          "id": "poi-fixer-hideout",
          "name": "Убежище фиксера",
          "description": "Убежище фиксера в Watson. Здесь фиксеры организуют контракты и встречи. Можно найти работу или информацию.",
          "type": "building",
          "actions": ["look", "enter", "talk"],
          "lookDescription": "Вы смотрите на убежище фиксера. Неприметное здание, но здесь можно найти работу или информацию. Фиксеры знают всех и все в городе.",
          "enterDescription": "Вы входите в убежище фиксера. Внутри дымно, люди говорят о работе и контрактах. Фиксер сидит за столом, разговаривая с клиентами. Вы можете подойти к нему."
        },
        {
          "id": "poi-gang-territory",
          "name": "Территория банд",
          "description": "Территория банд в Watson. Valentinos, Maelstrom, Tyger Claws - все борются за контроль. Опасно даже днем.",
          "type": "area",
          "actions": ["look", "approach"],
          "lookDescription": "Вы смотрите на территорию банд. Граффити на стенах, подозрительные личности на улицах, патрули банд. Это место где нужно быть осторожным.",
          "approachDescription": "Вы приближаетесь к территории банд. Бандиты смотрят на вас подозрительно. \"Эй, что ты здесь делаешь? Это наша территория!\" Вам нужно решить, как действовать."
        }
      ],
      "ambientSounds": [
        "Шум промышленности",
        "Голоса бандитов",
        "Граффити на стенах",
        "Заброшенные заводы"
      ],
      "timeVariations": {
        "day": {
          "description": "Днем Watson оживлен. Торговцы работают, фиксеры организуют контракты, банды патрулируют территории. Здесь кипит жизнь, но нужно быть осторожным."
        },
        "night": {
          "description": "Ночью Watson становится опаснее. Банды активнее, патрули NCPD реже, подозрительные личности на улицах. Лучше не ходить здесь ночью без причины."
        }
      }
    },
    "loc-westbrook-001": {
      "locationId": "loc-westbrook-001",
      "pointsOfInterest": [
        {
          "id": "poi-elite-complex",
          "name": "Элитный комплекс",
          "description": "Элитный жилой комплекс в Westbrook. Роскошные апартаменты, панорамные окна, частная охрана. Здесь живут богатые и влиятельные жители Night City.",
          "type": "building",
          "actions": ["look", "approach"],
          "lookDescription": "Вы смотрите на элитный комплекс. Высокие башни, роскошные апартаменты, частная охрана. Это символ богатства и власти в Night City.",
          "approachDescription": "Вы подходите к элитному комплексу. Охранник останавливает вас. \"Это частная территория. Вход только для жителей и их гостей.\" Вам нужно уйти."
        },
        {
          "id": "poi-luxury-shops",
          "name": "Роскошные магазины",
          "description": "Роскошные магазины в Westbrook. Здесь продают лучшее оборудование и услуги - элитное оружие, броню, импланты. Все дорого, но качественно.",
          "type": "area",
          "actions": ["explore", "shop"],
          "exploreDescription": "Вы исследуете роскошные магазины Westbrook. Элегантные витрины, дорогие товары, богатые клиенты. Здесь можно найти лучшее оборудование, но за это нужно платить.",
          "shopDescription": "Вы заходите в роскошный магазин. Торговец элегантно улыбается. \"Добро пожаловать, сэр. У нас есть лучшее оборудование для тех, кто может себе это позволить.\""
        }
      ],
      "ambientSounds": [
        "Тишина элитных кварталов",
        "Голоса богатых клиентов",
        "Роскошные машины",
        "Частная охрана патрулирует"
      ],
      "timeVariations": {
        "day": {
          "description": "Днем Westbrook спокоен. Богатые клиенты делают покупки, роскошные машины ездят по улицам, частная охрана патрулирует территорию. Все выглядит безопасно и роскошно."
        },
        "night": {
          "description": "Ночью Westbrook становится еще тише. Магазины закрыты, но элитные клубы открыты. Роскошные машины и частная охрана все еще патрулируют улицы."
        }
      }
    },
    "loc-santo-domingo-001": {
      "locationId": "loc-santo-domingo-001",
      "pointsOfInterest": [
        {
          "id": "poi-industrial-zone",
          "name": "Промышленная зона",
          "description": "Промышленная зона в Santo Domingo. Здесь работают обычные люди на заводах и складах. Тяжелый труд за небольшие деньги.",
          "type": "area",
          "actions": ["look", "explore"],
          "lookDescription": "Вы смотрите на промышленную зону. Заводы, склады, рабочие спешат на работу. Это место где работают обычные люди.",
          "exploreDescription": "Вы исследуете промышленную зону. Вы видите заводы, склады, рабочих. Здесь можно найти работу, но это тяжелый труд за небольшие деньги."
        },
        {
          "id": "poi-residential-quarter",
          "name": "Жилой квартал",
          "description": "Жилой квартал в Santo Domingo. Здесь живут рабочие. Простые здания, базовые удобства, доступные цены.",
          "type": "area",
          "actions": ["look", "explore"],
          "lookDescription": "Вы смотрите на жилой квартал. Простые здания, базовые удобства, люди спешат на работу или домой. Это место где живут обычные люди.",
          "exploreDescription": "Вы исследуете жилой квартал. Вы видите простые здания, людей, которые живут обычной жизнью. Здесь можно найти базовые товары и простые задания."
        }
      ],
      "ambientSounds": [
        "Шум промышленности",
        "Голоса рабочих",
        "Загруженные улицы",
        "Торговые точки"
      ],
      "timeVariations": {
        "day": {
          "description": "Днем Santo Domingo оживлен. Рабочие спешат на работу, торговцы работают, люди живут обычной жизнью. Все выглядит спокойно и просто."
        },
        "night": {
          "description": "Ночью Santo Domingo становится тише. Большинство рабочих дома, но некоторые торговые точки все еще открыты. Улицы загружены, но менее оживлены."
        }
      }
    },
    "loc-heywood-001": {
      "locationId": "loc-heywood-001",
      "pointsOfInterest": [
        {
          "id": "poi-valentinos-territory",
          "name": "Территория Valentinos",
          "description": "Территория банды Valentinos в Heywood. Южная часть района под их контролем. Граффити на стенах, патрули банды, уличная культура.",
          "type": "area",
          "actions": ["look", "approach"],
          "lookDescription": "Вы смотрите на территорию Valentinos. Граффити на стенах, патрули банды, уличная культура. Это место где честь и семья важнее денег.",
          "approachDescription": "Вы приближаетесь к территории Valentinos. Бандиты смотрят на вас. \"Эй, новичок. Ты в нашей территории. Если хочешь работать на нас, сначала покажи, что ты стоишь чего-то.\""
        },
        {
          "id": "poi-street-culture",
          "name": "Уличная культура",
          "description": "Уличная культура Heywood. Граффити, музыка, танцы. Здесь живут те, кто выбрал улицу вместо корпораций.",
          "type": "area",
          "actions": ["look", "explore"],
          "lookDescription": "Вы смотрите на уличную культуру Heywood. Граффити, музыка, танцы, люди на улицах. Это место где честь и семья важнее денег.",
          "exploreDescription": "Вы исследуете уличную культуру Heywood. Вы видите граффити, слышите музыку, видите людей, которые живут уличной жизнью. Здесь можно найти контакты и информацию."
        },
        {
          "id": "poi-gang-conflict-zone",
          "name": "Зона конфликтов банд",
          "description": "Зона конфликтов банд в Heywood. Valentinos, 6th Street, Maelstrom - все борются за контроль. Опасно даже днем.",
          "type": "area",
          "actions": ["look", "avoid"],
          "lookDescription": "Вы смотрите на зону конфликтов банд. Граффити разных банд на стенах, подозрительные личности, патрули банд. Это место где конфликты постоянны.",
          "avoidDescription": "Вы избегаете зону конфликтов банд. Лучше не попадать в перестрелку между бандами. Вы обходите опасную зону."
        }
      ],
      "ambientSounds": [
        "Граффити на стенах",
        "Музыка уличной культуры",
        "Голоса бандитов",
        "Конфликты между бандами"
      ],
      "timeVariations": {
        "day": {
          "description": "Днем Heywood все еще опасен. Банды патрулируют территории, конфликты постоянны, подозрительные личности на улицах. Лучше быть осторожным."
        },
        "night": {
          "description": "Ночью Heywood становится еще опаснее. Банды активнее, патрули NCPD реже, конфликты интенсивнее. Это место где новичкам не место ночью."
        }
      }
    }
  }
}

