{
  "actions": {
    "explore": {
      "downtown": [
        {
          "id": "explore-skyscrapers",
          "name": "Осмотреть небоскребы",
          "description": "Вы смотрите на небоскребы вокруг. Arasaka Tower возвышается над всем районом, его корпоративный логотип светится в небе. Militech Building стоит рядом, его военная эстетика контрастирует с элегантностью Arasaka. Здесь власть и деньги управляют всем."
        },
        {
          "id": "explore-streets",
          "name": "Осмотреть улицы",
          "description": "Улицы Downtown чистые и безопасные. Корпоративная охрана патрулирует каждый угол, NCPD дежурит на перекрестках. Люди спешат на работу или бизнес-встречи. Здесь нет места уличным бандам или беспорядкам - корпорации контролируют все."
        },
        {
          "id": "explore-traders",
          "name": "Осмотреть торговцев",
          "description": "В Downtown работают профессиональные торговцы. Они продают качественное оборудование, но за это нужно платить. Цены здесь выше, чем в других районах, но качество гарантировано."
        }
      ],
      "watson": [
        {
          "id": "explore-factories",
          "name": "Осмотреть заброшенные заводы",
          "description": "Заброшенные заводы Watson - это наследие прошлого. Когда-то здесь производили технологии, но теперь это руины. Банды используют их как убежища, торговцы - как склады. Здесь можно найти старые технологии и ресурсы, если быть осторожным."
        },
        {
          "id": "explore-graffiti",
          "name": "Осмотреть граффити",
          "description": "Граффити на стенах рассказывают историю банд Watson. Valentinos - красные и золотые цвета, символы семьи и чести. Maelstrom - черные и красные, символы киберпанка и технологий. Tyger Claws - желтые и черные, символы азиатской культуры. Каждая банда помечает свою территорию."
        },
        {
          "id": "explore-underground",
          "name": "Осмотреть подпольную жизнь",
          "description": "В Watson кипит подпольная жизнь. Фиксеры организуют контракты в заброшенных зданиях, торговцы продают нелегальные товары в переулках, бандиты патрулируют свои территории. Здесь все возможно, если знаешь где искать и с кем говорить."
        }
      ],
      "westbrook": [
        {
          "id": "explore-complexes",
          "name": "Осмотреть элитные комплексы",
          "description": "Элитные жилые комплексы Westbrook - это символ богатства и власти. Высокие башни с панорамными окнами, роскошные апартаменты, частная охрана. Здесь живут те, кто управляет Night City - корпоративные руководители, политики, знаменитости."
        },
        {
          "id": "explore-shops",
          "name": "Осмотреть дорогие магазины",
          "description": "Дорогие магазины Westbrook предлагают лучшее оборудование и услуги. Здесь можно купить элитное оружие, броню, импланты - но за это нужно платить. Цены здесь в несколько раз выше, чем в других районах, но качество соответствующее."
        }
      ],
      "santo_domingo": [
        {
          "id": "explore-industrial",
          "name": "Осмотреть промышленные зоны",
          "description": "Промышленные зоны Santo Domingo - это место где работают обычные люди. Заводы производят товары для корпораций, склады хранят грузы. Здесь можно найти работу, но это тяжелый труд за небольшие деньги."
        },
        {
          "id": "explore-residential",
          "name": "Осмотреть жилые кварталы",
          "description": "Жилые кварталы Santo Domingo - это место где живут рабочие. Простые здания, базовые удобства, доступные цены. Здесь нет роскоши, но есть все необходимое для жизни."
        }
      ],
      "heywood": [
        {
          "id": "explore-gang-territory",
          "name": "Осмотреть территорию банд",
          "description": "Территория банд в Heywood четко разделена. Valentinos контролируют южную часть, 6th Street - северную, Maelstrom - центральную. Каждая банда патрулирует свою территорию, и конфликты здесь постоянны. Пересечение границ может быть опасным."
        },
        {
          "id": "explore-street-culture",
          "name": "Осмотреть уличную культуру",
          "description": "Уличная культура Heywood - это граффити, музыка, танцы. Здесь живут те, кто выбрал улицу вместо корпораций. Это место где честь и семья важнее денег, но выживание требует силы и умения."
        }
      ]
    },
    "rest": {
      "description": "Вы находите тихое место и отдыхаете. Здоровье и энергия постепенно восстанавливаются. Время проходит, но вы чувствуете себя лучше.",
      "healthRestore": 20,
      "energyRestore": 30,
      "timeRequired": 5
    },
    "use": {
      "generic": "Вы подходите к объекту и пытаетесь его использовать. [Описание объекта и результата взаимодействия зависит от типа объекта]"
    },
    "hack": {
      "description": "Вы пытаетесь подключиться к системе. Это требует навыков хакерства и техники. [Описание процесса хакерства и результата зависит от уровня навыков]",
      "requirements": {
        "skills": ["hacking", "technical"],
        "minLevel": 3
      }
    }
  },
  "movement": {
    "success": "Вы перемещаетесь из {from} в {to}. Путь занимает {time} минут. По пути вы видите {pathDescription}. Вы прибываете в {newLocation}.",
    "dangerous": "Вы пытаетесь переместиться в {location}. Это опасное место, и вы не уверены, что готовы. Вы уверены, что хотите продолжить?",
    "obstacle": "Вы пытаетесь переместиться, но на пути препятствие. {obstacleDescription}. Вам нужно решить, как действовать.",
    "pathDescriptions": {
      "downtown-watson": "По пути вы проезжаете через промышленные зоны. Заброшенные заводы и склады видны вдалеке. Воздух становится менее чистым, но атмосфера более живая.",
      "downtown-westbrook": "По пути вы проезжаете через элитные кварталы. Роскошные здания и дорогие магазины окружают вас. Все выглядит чистым и безопасным.",
      "watson-santo-domingo": "По пути вы проезжаете через рабочие кварталы. Простые здания и люди, спешащие на работу. Атмосфера спокойная, но не роскошная.",
      "watson-heywood": "По пути вы проезжаете через опасную зону. Граффити банд на стенах, подозрительные личности на улицах. Вы чувствуете, что здесь небезопасно.",
      "santo-domingo-heywood": "По пути вы проезжаете через границу между рабочими и бандитскими районами. Атмосфера становится напряженной, вы видите патрули банд."
    }
  },
  "combat": {
    "start": "Бой начинается! Вы сталкиваетесь с {enemyName}. Он готов к бою, и вы готовы сражаться. Здоровье: {playerHealth}, здоровье врага: {enemyHealth}. Ваш ход!",
    "attack": {
      "pistol": "Вы стреляете из пистолета! Выстрел попадает в цель. Урон: {damage}. {enemyName} получает урон, его здоровье: {enemyHealth}.",
      "rifle": "Вы стреляете из винтовки! Выстрел точный и мощный. Урон: {damage}. {enemyName} получает урон, его здоровье: {enemyHealth}.",
      "knife": "Вы атакуете ножом! Быстрый удар в ближнем бою. Урон: {damage}. {enemyName} получает урон, его здоровье: {enemyHealth}.",
      "generic": "Вы атакуете {weaponName}! {attackDescription}. Урон: {damage}. {enemyName} получает урон, его здоровье: {enemyHealth}."
    },
    "defend": "Вы принимаете защитную позицию. Броня поглощает часть урона. {enemyName} атакует, но ваша защита снижает урон.",
    "enemyAttack": "{enemyName} атакует вас! {attackDescription}. Урон: {damage}. Ваше здоровье: {playerHealth}.",
    "victory": "{enemyName} повержен! Вы побеждаете в бою. Получено: {experience} XP, {money} eddies, {loot}. Вы чувствуете себя усталым, но победоносным.",
    "defeat": "Вы проиграли бой. {enemyName} оказался сильнее. Вы теряете сознание и оказываетесь в {location}. Вы потеряли {money} eddies и часть опыта."
  }
}

