{
  "dialogueTrees": {
    "npc-jake-archer": {
      "npcId": "npc-jake-archer",
      "greeting": "Привет, чомбата. Добро пожаловать в мой магазин. Я Джейк Арчер, и я продаю качественное оборудование для начинающих и опытных. Что тебе нужно?",
      "branches": [
        {
          "id": "branch-about-city",
          "trigger": "Расскажи о городе",
          "responses": [
            {
              "id": "response-city-1",
              "text": "Night City - это место возможностей и опасностей. В Downtown безопасно, но дорого. Здесь корпорации контролируют все, и все стоит дорого.",
              "nextBranch": "branch-city-details"
            }
          ]
        },
        {
          "id": "branch-city-details",
          "trigger": "Расскажи больше",
          "responses": [
            {
              "id": "response-city-details-1",
              "text": "В Watson больше возможностей, но и больше риска - банды, торговцы, фиксеры. Будь осторожен, особенно в Heywood - там банды контролируют все, и новичкам там не место.",
              "nextBranch": null
            }
          ]
        },
        {
          "id": "branch-about-business",
          "trigger": "Как дела в бизнесе?",
          "responses": [
            {
              "id": "response-business-1",
              "text": "Дела идут неплохо. Корпоративные клиенты покупают качественное оборудование, а новички - базовые вещи. Главное - быть честным и не продавать хлам. Репутация важнее быстрой прибыли.",
              "nextBranch": null
            }
          ]
        },
        {
          "id": "branch-about-items",
          "trigger": "Какие товары у тебя есть?",
          "responses": [
            {
              "id": "response-items-1",
              "text": "У меня есть базовое оружие - пистолеты, ножи, винтовки. Броня - от базовой до корпоративной. Медикаменты - медипаки, стимуляторы. Все качественное, проверенное. Если нужно что-то особенное - могу заказать, но это будет дороже.",
              "nextBranch": null
            }
          ]
        },
        {
          "id": "branch-trade",
          "trigger": "Торговля",
          "responses": [
            {
              "id": "response-trade-1",
              "text": "Конечно! Посмотри, что у меня есть. Все качественное, проверенное. Цены разумные, особенно для новичков.",
              "action": "open_shop"
            }
          ]
        }
      ]
    },
    "npc-sarah-miller": {
      "npcId": "npc-sarah-miller",
      "greeting": "Привет. Я офицер Миллер, NCPD. Если ты хочешь помочь полиции и заработать немного денег, у меня есть задания. Простые, но полезные для города.",
      "branches": [
        {
          "id": "branch-about-ncpd",
          "trigger": "Расскажи о NCPD",
          "responses": [
            {
              "id": "response-ncpd-1",
              "text": "NCPD - это полиция Night City. Мы поддерживаем порядок, но в этом городе это нелегко. Банды, корпорации, преступники - все хотят контролировать свои территории. Нам нужна помощь от таких как ты - тех, кто готов работать на закон и порядок.",
              "nextBranch": null
            }
          ]
        },
        {
          "id": "branch-about-quests",
          "trigger": "Какие задания у тебя есть?",
          "responses": [
            {
              "id": "response-quests-1",
              "text": "У меня есть простое задание - доставить посылку в Watson торговцу Рита Морено. Это безопасно, но нужно быть осторожным при перемещении между районами. Заплачу 200 eddies за выполнение.",
              "nextBranch": "branch-quest-details"
            }
          ]
        },
        {
          "id": "branch-quest-details",
          "trigger": "Расскажи детали",
          "responses": [
            {
              "id": "response-quest-details-1",
              "text": "Нужно доставить посылку из Downtown в Watson. Путь не самый безопасный, но если быть осторожным, все будет хорошо. Просто найди Риту Морено в Watson и передай ей посылку.",
              "nextBranch": null,
              "action": "show_quest"
            }
          ]
        },
        {
          "id": "branch-why-police",
          "trigger": "Почему вы не можете сделать это сами?",
          "responses": [
            {
              "id": "response-why-1",
              "text": "У нас не хватает ресурсов для всего. Мы патрулируем Downtown, но у нас нет времени на каждую мелкую доставку. Поэтому мы просим помощи у граждан, которые готовы помочь.",
              "nextBranch": null
            }
          ]
        },
        {
          "id": "branch-accept-quest",
          "trigger": "Принять задание",
          "responses": [
            {
              "id": "response-accept-1",
              "text": "Отлично! Вот посылка. Доставь ее Рите Морено в Watson. Удачи!",
              "action": "accept_quest",
              "nextBranch": null
            }
          ]
        }
      ]
    },
    "npc-marco-fix": {
      "npcId": "npc-marco-fix",
      "greeting": "Привет, чомбата. Я Марко, но все зовут меня Фикс. Если тебе нужна работа или информация - обращайся. Я знаю всех и все в этом городе.",
      "branches": [
        {
          "id": "branch-about-fixer",
          "trigger": "Что делает фиксер?",
          "responses": [
            {
              "id": "response-fixer-1",
              "text": "Фиксер - это посредник. Мы связываем людей, которые нуждаются в работе, с теми, кто может ее выполнить. Мы знаем все - кто, что, где, когда. За это мы берем процент. Но главное - мы знаем, кому можно доверять, а кому нет.",
              "nextBranch": null
            }
          ]
        },
        {
          "id": "branch-about-quests",
          "trigger": "Есть ли у тебя работа?",
          "responses": [
            {
              "id": "response-quests-1",
              "text": "У меня есть простое задание - найти торговца Джейка Арчера в Downtown и поговорить с ним о поставке. Это просто, но нужно знать, где искать. Заплачу 250 eddies.",
              "nextBranch": "branch-quest-details"
            }
          ]
        },
        {
          "id": "branch-quest-details",
          "trigger": "Расскажи детали",
          "responses": [
            {
              "id": "response-quest-details-1",
              "text": "Нужно найти Джейка Арчера в Downtown. Он работает в корпоративном районе, продает базовое оборудование. Поговори с ним о поставке товаров. Он знает, что делать.",
              "nextBranch": null,
              "action": "show_quest"
            }
          ]
        },
        {
          "id": "branch-about-watson",
          "trigger": "Расскажи о Watson",
          "responses": [
            {
              "id": "response-watson-1",
              "text": "Watson - это место где все возможно. Банды, торговцы, фиксеры - все здесь. Но будь осторожен - здесь не так безопасно как в Downtown. Знай, с кем имеешь дело, и не связывайся с бандами без причины.",
              "nextBranch": null
            }
          ]
        }
      ]
    },
    "npc-jose-tiger": {
      "npcId": "npc-jose-tiger",
      "greeting": "Эй, новичок. Ты в Heywood, это территория Valentinos. Если хочешь работать на нас, сначала покажи, что ты стоишь чего-то. Мы не принимаем слабаков.",
      "branches": [
        {
          "id": "branch-about-valentinos",
          "trigger": "Расскажи о Valentinos",
          "responses": [
            {
              "id": "response-valentinos-1",
              "text": "Valentinos - это семья. Мы уважаем честь, традиции, семью. Если ты готов сражаться за нас, мы примем тебя. Но сначала нужно доказать свою верность. Мы не принимаем слабаков или предателей.",
              "nextBranch": null
            }
          ]
        },
        {
          "id": "branch-about-quests",
          "trigger": "Есть ли у тебя работа?",
          "responses": [
            {
              "id": "response-quests-1",
              "text": "У меня есть задание для тех, кто готов показать уважение к банде. Но это не для новичков. Вернись, когда станешь сильнее. Нужно быть хотя бы 5 уровня, чтобы работать на нас.",
              "nextBranch": null,
              "requirements": {
                "level": 5
              }
            }
          ]
        },
        {
          "id": "branch-about-name",
          "trigger": "Почему тебя зовут Тигр?",
          "responses": [
            {
              "id": "response-name-1",
              "text": "Потому что я сильный, быстрый и опасный. Как тигр. Я не боюсь никого, и все боятся меня. Это уважение, которое я заработал своей силой и верностью банде.",
              "nextBranch": null
            }
          ]
        },
        {
          "id": "branch-show-respect",
          "trigger": "Я готов показать уважение",
          "responses": [
            {
              "id": "response-respect-1",
              "text": "Хорошо. У меня есть задание - разобраться с бандитами Maelstrom в Heywood. Убей трех из них, и я поверю, что ты стоишь чего-то.",
              "nextBranch": null,
              "action": "show_quest",
              "requirements": {
                "level": 5,
                "reputation": {
                  "faction": "valentinos",
                  "minValue": 0
                }
              }
            }
          ]
        }
      ]
    }
  }
}

