{
  "npcs": [
    {
      "id": "npc-jake-archer",
      "name": "Джейк Арчер",
      "description": "Торговец средних лет, работает в корпоративном районе. Носит аккуратный костюм, всегда вежлив и профессиональен. Его магазин - место где можно купить базовое оружие, броню и медикаменты по разумным ценам.",
      "locationId": "loc-downtown-001",
      "faction": "independent",
      "type": "trader",
      "reputation": {
        "faction": "independent",
        "baseValue": 0
      },
      "greeting": "Привет, чомбата. Что тебе нужно? У меня есть хорошие товары для начинающих.",
      "dialogueOptions": [
        {
          "id": "talk-about-city",
          "text": "Расскажи о городе",
          "response": "Night City - это место возможностей и опасностей. В Downtown безопасно, но дорого. В Watson больше возможностей, но и больше риска. Будь осторожен, особенно в Heywood - там банды контролируют все."
        },
        {
          "id": "talk-about-business",
          "text": "Как дела в бизнесе?",
          "response": "Дела идут неплохо. Корпоративные клиенты покупают качественное оборудование, а новички - базовые вещи. Главное - быть честным и не продавать хлам."
        }
      ]
    },
    {
      "id": "npc-sarah-miller",
      "name": "Сара Миллер",
      "description": "Офицер NCPD, работает в корпоративном районе. Молодая, но опытная. Всегда готова помочь новичкам, если они готовы помочь полиции. Дает простые задания для поддержания порядка.",
      "locationId": "loc-downtown-001",
      "faction": "ncpd",
      "type": "quest_giver",
      "reputation": {
        "faction": "ncpd",
        "baseValue": 0
      },
      "greeting": "Привет. Я офицер Миллер. Если ты хочешь помочь полиции и заработать немного денег, у меня есть задания.",
      "dialogueOptions": [
        {
          "id": "talk-about-ncpd",
          "text": "Расскажи о NCPD",
          "response": "NCPD - это полиция Night City. Мы поддерживаем порядок, но в этом городе это нелегко. Банды, корпорации, преступники - все хотят контролировать свои территории. Нам нужна помощь от таких как ты."
        },
        {
          "id": "talk-about-quests",
          "text": "Какие задания у тебя есть?",
          "response": "У меня есть простое задание - доставить посылку в Watson. Это безопасно, но нужно быть осторожным. Заплачу 200 eddies."
        }
      ],
      "availableQuests": ["quest-delivery-001"]
    },
    {
      "id": "npc-victor-vector",
      "name": "Виктор Вектор",
      "description": "Хирург-имплантолог, работает в Downtown. Опытный риппердок, может устанавливать базовые импланты. Независимый, не связан с корпорациями. Всегда готов помочь, если есть деньги.",
      "locationId": "loc-downtown-001",
      "faction": "independent",
      "type": "citizen",
      "reputation": {
        "faction": "independent",
        "baseValue": 0
      },
      "greeting": "Привет. Я Виктор, риппердок. Могу установить импланты, но для MVP это пока недоступно. Зайди позже.",
      "dialogueOptions": [
        {
          "id": "talk-about-implants",
          "text": "Расскажи об имплантах",
          "response": "Импланты - это будущее. Они могут улучшить твои способности, но за это платишь человечностью. Будь осторожен - слишком много имплантов может привести к киберпсихозу."
        }
      ]
    },
    {
      "id": "npc-rita-moreno",
      "name": "Рита Морено",
      "description": "Независимая торговка в Watson. Молодая, энергичная, знает все о подпольном мире. Ее магазин - место где можно найти что угодно, от оружия до информации. Всегда готова торговаться.",
      "locationId": "loc-watson-001",
      "faction": "independent",
      "type": "trader",
      "reputation": {
        "faction": "independent",
        "baseValue": 0
      },
      "greeting": "О, новый клиент! Привет, чомбата. У меня есть все что нужно - оружие, броня, медикаменты. И я знаю, где найти что угодно.",
      "dialogueOptions": [
        {
          "id": "talk-about-watson",
          "text": "Расскажи о Watson",
          "response": "Watson - это место где все возможно. Банды, торговцы, фиксеры - все здесь. Но будь осторожен - здесь не так безопасно как в Downtown. Знай, с кем имеешь дело."
        },
        {
          "id": "talk-about-deals",
          "text": "Какие у тебя есть товары?",
          "response": "У меня есть базовое оружие, броня, медикаменты. Все качественное, проверенное. Если нужно что-то особенное - могу найти, но это будет дороже."
        }
      ],
      "availableQuests": ["quest-merchant-defense-002"]
    },
    {
      "id": "npc-marco-fix",
      "name": "Марко \"Фикс\" Санчес",
      "description": "Независимый фиксер в Watson. Средних лет, опытный, знает все о подпольном мире Night City. Организует контракты, дает информацию, знает где найти что угодно. Его кличка \"Фикс\" говорит сама за себя.",
      "locationId": "loc-watson-001",
      "faction": "independent",
      "type": "quest_giver",
      "reputation": {
        "faction": "independent",
        "baseValue": 0
      },
      "greeting": "Привет, чомбата. Я Марко, но все зовут меня Фикс. Если тебе нужна работа или информация - обращайся. Я знаю всех и все в этом городе.",
      "dialogueOptions": [
        {
          "id": "talk-about-fixer",
          "text": "Что делает фиксер?",
          "response": "Фиксер - это посредник. Мы связываем людей, которые нуждаются в работе, с теми, кто может ее выполнить. Мы знаем все - кто, что, где, когда. За это мы берем процент."
        },
        {
          "id": "talk-about-quests",
          "text": "Есть ли у тебя работа?",
          "response": "У меня есть простое задание - найти торговца Джейка Арчера в Downtown. Нужно поговорить с ним о поставке. Заплачу 250 eddies."
        }
      ],
      "availableQuests": ["quest-find-trader-001"]
    },
    {
      "id": "npc-gangster-generic",
      "name": "Бандит",
      "description": "Бандит, патрулирующий улицы Watson. Агрессивен, опасен, всегда готов к бою. Принадлежит к одной из банд - Maelstrom, Valentinos или Tyger Claws. Не стоит связываться без причины.",
      "locationId": "loc-watson-001",
      "faction": "maelstrom",
      "type": "enemy",
      "reputation": {
        "faction": "maelstrom",
        "baseValue": -50
      },
      "greeting": "Эй, что ты здесь делаешь? Это моя территория!",
      "dialogueOptions": [
        {
          "id": "talk-back-off",
          "text": "Ухожу, не трогай меня",
          "response": "Правильно, уходи. И больше не возвращайся."
        },
        {
          "id": "talk-fight",
          "text": "Хочешь драться?",
          "response": "Ха! Ты сам напросился! Давай, покажу тебе что такое настоящий бой!"
        }
      ]
    },
    {
      "id": "npc-carlos-mendez",
      "name": "Карлос Мендес",
      "description": "Торговец в Santo Domingo. Работает здесь много лет, обслуживает рабочих и местных жителей. Продает базовые товары по доступным ценам. Всегда дружелюбен и готов помочь.",
      "locationId": "loc-santo-domingo-001",
      "faction": "independent",
      "type": "trader",
      "reputation": {
        "faction": "independent",
        "baseValue": 0
      },
      "greeting": "Привет, дружище. Добро пожаловать в Santo Domingo. У меня есть все что нужно для работы и жизни.",
      "dialogueOptions": [
        {
          "id": "talk-about-santo-domingo",
          "text": "Расскажи о Santo Domingo",
          "response": "Santo Domingo - это рабочий район. Здесь живут обычные люди, которые работают на заводах и в корпорациях. Все просто, но честно. Здесь можно найти базовые товары и простые задания."
        }
      ]
    },
    {
      "id": "npc-anna-petrova",
      "name": "Анна Петрова",
      "description": "Рабочая в Santo Domingo. Молодая, энергичная, всегда готова помочь. Дает простые задания на доставку - это хороший способ заработать для новичков.",
      "locationId": "loc-santo-domingo-001",
      "faction": "independent",
      "type": "quest_giver",
      "reputation": {
        "faction": "independent",
        "baseValue": 0
      },
      "greeting": "Привет! Я Анна. Если тебе нужна работа, у меня есть задание - доставить посылку. Это просто, но нужно быть осторожным.",
      "dialogueOptions": [
        {
          "id": "talk-about-quests",
          "text": "Какое задание?",
          "response": "Нужно доставить посылку из Santo Domingo в Watson. Путь не самый безопасный, но если быть осторожным, все будет хорошо. Заплачу 300 eddies."
        }
      ],
      "availableQuests": ["quest-package-delivery-001"]
    },
    {
      "id": "npc-elizabeth-chen",
      "name": "Элизабет Чен",
      "description": "Элитная торговка в Westbrook. Обслуживает богатых клиентов - корпоративных руководителей, влиятельных персон. Продает дорогие, высококачественные товары. Всегда элегантна и профессиональна.",
      "locationId": "loc-westbrook-001",
      "faction": "independent",
      "type": "trader",
      "reputation": {
        "faction": "independent",
        "baseValue": 0
      },
      "greeting": "Добро пожаловать. Я Элизабет Чен. У меня есть лучшие товары для тех, кто может себе это позволить.",
      "dialogueOptions": [
        {
          "id": "talk-about-westbrook",
          "text": "Расскажи о Westbrook",
          "response": "Westbrook - это район для элиты. Здесь живут самые богатые и влиятельные жители Night City. Все здесь дорого, но качественно. Если у тебя есть деньги, здесь можно найти лучшее."
        }
      ]
    },
    {
      "id": "npc-jose-tiger",
      "name": "Хосе \"Тигр\" Рамирес",
      "description": "Лидер банды Valentinos в Heywood. Опасный, но уважает тех, кто заслужил уважение. Может давать задания тем, кто доказал свою верность банде. Не стоит связываться с ним без причины.",
      "locationId": "loc-heywood-001",
      "faction": "valentinos",
      "type": "quest_giver",
      "reputation": {
        "faction": "valentinos",
        "baseValue": 0
      },
      "greeting": "Эй, новичок. Ты в Heywood, это территория Valentinos. Если хочешь работать на нас, сначала покажи, что ты стоишь чего-то.",
      "dialogueOptions": [
        {
          "id": "talk-about-valentinos",
          "text": "Расскажи о Valentinos",
          "response": "Valentinos - это семья. Мы уважаем честь, традиции, семью. Если ты готов сражаться за нас, мы примем тебя. Но сначала нужно доказать свою верность."
        },
        {
          "id": "talk-about-quests",
          "text": "Есть ли у тебя работа?",
          "response": "У меня есть задание для тех, кто готов показать уважение к банде. Но это не для новичков. Вернись, когда станешь сильнее."
        }
      ],
      "availableQuests": ["quest-show-respect-001"]
    }
  ]
}

