{
  "locations": [
    {
      "id": "loc-downtown-001",
      "name": "Downtown - Корпоративный центр",
      "description": "Вы стоите в центре корпоративного района Night City. Вокруг вас возвышаются небоскребы мегакорпораций - Arasaka, Militech и другие. Неоновые вывески мигают на стенах зданий, отражаясь в стеклянных фасадах. На улице проходят люди в деловых костюмах, многие с заметными корпоративными имплантами. Здесь царит порядок и безопасность - NCPD патрулирует улицы, корпоративная охрана стоит на постах у входов в офисные здания.",
      "city": "Night City",
      "district": "Downtown",
      "dangerLevel": "low",
      "minLevel": 1,
      "type": "corporate",
      "connectedLocations": [
        "loc-watson-001"
      ]
    },
    {
      "id": "loc-watson-001",
      "name": "Watson - Индустриальный район",
      "description": "Вы находитесь в индустриальном районе Watson. Заброшенные заводы и склады стоят рядом с рабочими кварталами. На стенах зданий граффити банд - Valentinos, Maelstrom, Tyger Claws. В воздухе смешаны запахи промышленности и уличной еды. Здесь кипит подпольная жизнь - торговцы, фиксеры, бандиты. Это место где закон и порядок слабее, но возможности больше.",
      "city": "Night City",
      "district": "Watson",
      "dangerLevel": "medium",
      "minLevel": 1,
      "type": "industrial",
      "connectedLocations": [
        "loc-downtown-001",
        "loc-santo-domingo-001",
        "loc-heywood-001"
      ]
    },
    {
      "id": "loc-westbrook-001",
      "name": "Westbrook - Богатый район",
      "description": "Вы в элитном районе Westbrook. Здесь живут богатые жители Night City - корпоративные руководители, влиятельные персоны. Элитные жилые комплексы, дорогие магазины, роскошные клубы. Улицы чистые, безопасность на высшем уровне. Корпоративная охрана патрулирует каждый угол. Здесь можно найти лучшее оборудование и услуги, но все стоит дорого.",
      "city": "Night City",
      "district": "Westbrook",
      "dangerLevel": "low",
      "minLevel": 3,
      "type": "residential",
      "connectedLocations": [
        "loc-downtown-001"
      ]
    },
    {
      "id": "loc-santo-domingo-001",
      "name": "Santo Domingo - Рабочий район",
      "description": "Вы в рабочем районе Santo Domingo. Промышленные зоны смешиваются с жилыми кварталами. Здесь живут рабочие и низкоуровневые жители Night City. Много торговых точек и базовых услуг. Улицы загружены, люди спешат на работу или домой. Это место где можно найти базовые товары по разумным ценам и простые задания.",
      "city": "Night City",
      "district": "Santo Domingo",
      "dangerLevel": "low",
      "minLevel": 1,
      "type": "residential",
      "connectedLocations": [
        "loc-watson-001"
      ]
    },
    {
      "id": "loc-heywood-001",
      "name": "Heywood - Бандитский район",
      "description": "Вы в районе под контролем банд - Heywood. Уличная культура, граффити на стенах, постоянные конфликты между бандами. Valentinos, 6th Street, Maelstrom - все борются за территорию. Здесь опасно даже днем, не говоря о ночи. Но здесь можно найти нелегальные товары, контакты и опасные, но прибыльные задания. Новичкам здесь не место.",
      "city": "Night City",
      "district": "Heywood",
      "dangerLevel": "high",
      "minLevel": 5,
      "type": "criminal",
      "connectedLocations": [
        "loc-watson-001",
        "loc-santo-domingo-001"
      ]
    }
  ]
}

